#  3 переменные с одинаковыми данными (и одинаковым типом) и с одинаковыми идентификаторами.

a = 3

a = 3

a = 3

# 2 переменные с одинаковыми данными (и одинаковым типом) и с разными идентификаторами

b = 2

e = 2

# Первые 3 разны индификаторы, 2 последних индификаторы =, даные равны у всех

h = 3

l = 3

n = 3

k = 2

k = 2

print(a)

print(b)

# a1 = ...., a2 = ...., a1 == a2 True , a1 is a2 True

g1 = 4

g2 = 4

print(g1 == g2)

print(g1 is g2)

# a1 == a2 True, a1 is a2 False

q1 = [5]

q2 = [5]

print(q1 == q2)

print(q1 is q2)